#%%
import csv
import regex
prefix = "outcomes/hmiku/hmiku"

rows = []
with open(prefix + '.csv', newline='') as csvfile:
     spamreader = csv.reader(csvfile, delimiter=',', quotechar='"')
     for row in spamreader:
         rows.append(row)
# %%
def write_csv(data, fn):
    with open(fn, 'w', newline='') as csvfile:
        writter = csv.writer(csvfile, delimiter=',',
                                quotechar='"', quoting=csv.QUOTE_MINIMAL)
        for i in data:
            writter.writerow(i)
# %%
simp = regex.compile(r'[辘纡权轱继辋钅资悯䲞钖诿婵讼㐹䍠辊逦铽驴馏鸾毕鸳跃栋粪峤鲱苇槠吨酝执吴趱垦㴋颈辎窝异邓忏咤颁䌺鹑颣轾纯鸵捝娅痒㛿粝鳜侧蛳坜岚寻妩滗图巩馃㳽㭏贼砚铨鹭气枭垫暅锠谦怀䴓怜协苋觊韦筼呙跻伞谝绋酿䞌奖铅锖椫织撷鸻顺璎郐驮专觏鳋顾筜戋秾䓓诔㧐椠润变伛罴贞谞㓰遗呜咝邬驹韧埘愠耧帜觍闻哗鹞总扩渑狞銮笼䦃罗举哟缭钽县硷绵阋挝谓丛挞铬浉壳屃骕顸毵肤缧铕锞扬阚桦镣颃灾坚轶桡欢辅骚译䲢㡎绩㳢竞蚝殇鹓䀥鲶赐剐阓钮闹褴咙旷坟钳亿脍饽䢀伥芲赅蔹综恼纮抟侪䯄颅鳞缡谤㤘养鸺绤缴镬龉鳃顷鸦衔钦涣箩眍读儿铱谴稳贳聂诽珰饿轫闱啯滚渍货诮腻祎钞讧谒诲锪疟焖诫锏犊铢羡绑劲桥浊搀赪责终鲆钯蒏粮财䅪赜帮谄㳡痨慑溁巅隶萤纵榅镏笾钎单䜤颠书馈败纶筹弃污浈谳时赡骖蹒鲕盏鹱积贻鲎鹌萧鹢浔窥贩凭韪昽缊钼烨袆饩贺茕绠饳贶鹮缐铷鳤计缢㺍狈锸窍鳍荮铊访㧰篱鲝翙饶禀练㻘锺颛贠颀桪诰烧虬钏觞险药鳓辍莱俩场涛泽签俭浐纸闵锛驻钭审这缌挜雏贸睑雳鲙箓钝诚荆辉鲰颢鲖愦严鳕鼋䦁蒌诨汉鸹烫夺灶砀膻揾纤纹绀软鿒掳谅鸩瞩鼗墙穷鲒谥凿组铪搂铺俪洁龄递娄讦蒉泾纭郸违颓锋偻颕绱锧㟥压锝驶讣蟏侬颌埚锔镳怿钍谘乐导迈鞒闾赉铓庑运苈冈笕锬赠风锼峣鹀澜锐鲅唤糁滢长钣镗绬辁蕲侦䅉赵桧摆鳟䥽氢荙连关杨谙铤谯怄䜩玑詟皱肾媭迟侨谰鲭辑档钗萨鹠哑鲇鸬鞑锌谢悭蜗阖赕验蹰鲡颎匦尝驱傤恸俣䝙尴缞缵讳宠䅟虏晖㘎镱讶离绎廪费缍赗训显缕锈鹩驽铖鲗䦅鹕颟缎叁叽钫飗赒谉瘘辐唡为窜询胀鸤鲋鹯阒脸䜥鳆鹈镎阂炀缄兽废㶽赖评缬轵鹄丧讲牺䍁绍苔换縆烛萚鿏诜龆弪备闼匮鹎樯铴萦镔飒贯输讪驲锣谀渗䓕荧渊霁筿羁艰屉橼潆赚缥罚裆钘嫱莼衅挢诒鿎镙钐护饥奋痉岂认卺缆沦铵沨亘唝阵崃红顿钹挤鲃赂䯅绻闬赔傩祃筚诈㭴纟层䙌绐净哓娴钉侥脉镇鲿剧铫贰隽呛谡荦飨买嫒刚钟洒苎谲絷臜绝围渎㟆觃垆缔䇲锘滩觇陇骉饼饰镝钡桩靔莶恶饲铀鳂瘿钸痫鹾鳠皑鲨兴槚龁们闸鸣拢轨嵝峄阃谱蛊铆飞卧谐纱驸蔷箦镫诐哕吗脏枧萝赋蔼灿龚绛癣衮椭铼弯炽珲贤荣绰蝈齑躜马柽轪虿哜搅螀圆䲣邹钜扑轳骃渌䑽铞帼构腽梦黡镀农铡优乌䴔㻅矶纩斓骎玱鹴瘾鲼郦滨潍柠酽龀讠鲫谚厦汇凤赁䌸讥绒誊册趸鲠详删辕蹑掼痪缜殁帱储疡敩逊阌抢踬衬诊钕语骆谈穑顽陦帅晔华鲊赓铈箫缯纣涞鲲捡㐽诞鲌鲷躏圹烬赑篮疠纷䴕斋愤鸪赀轩闫猡皂滪荞轼诸圣馆则诠补针妫垴袭铂齿铠唠闯癫拣螨飑靓绽谶户骟诪梼铝溃缰谗糇驺闭埙玚嗳脑缠贿涝䲡浇枞焕镮鳎张无欤瑸驳浏铗蚬扫谫缤沥胶踌硕锯骧赎颋舻啧诼㓆谠赶绫㔉籴腾较牦郓劢婳讨泼郑阛讷质荬识鲮锫刽镲债赌麹蓥谩盐槛枪卢响鳀仓攒强硚烦师砜䜣齄幂笺仅盖鳇饧䌻钵凯䌼紧鹚岽纨诱庞阴骂馌肿鳖蓠讵奂殚耻滥藓鳘烩额艳兖龊硁恳东㛟测诘殒毶浒诧肃个选应刍瘆伫蒇挛俫叠辩骓镂缝锄飏胁岙舰暧荩择渖镘挦细陧哝鳡珑俨鲏霭哙绔轹错䉤泻仪锉蕴蝾绥缲绲骛渐厮纽傧营鳔岿啮瓯脔㛤诉瓒鲛鸲榄骗歼绚赞怃裤呒䌹瑶鳏该试镩阀蓣抡蛏纾钠垯须镤鸧忧飓鲯㶶鹐赛掷砾忾缈琏刾掸睁鹁脐锃处绨呕媪蓝觋饤苁馇谪䙓赈骞钻帐阉兹贴裈经钿骔订鲂鸱耸骄类并鱽蛲韨乡莺钚办亲绞锍锶骝矫泶泞锁冯辀铋殓饹䦀窑孪懒讯发阔糍鲄䶮戏髅鹬栏辖榉骑爱辏诓缘查绶鸴馎娇馐鉴荭谮鳁鬶靥镁蚂饣喾厕缗颍嘤嗫邻涨猃习鳚纲闲铐惊垭团缁铦纳鳄矿岭浕爷陆贷镐裣镖恽飘偿锿荨灏㥪鸠夹报对㚯历规颐镯镑钨椟绊荤疱髌传鳝罂亸诗论谁铩谇骙视剑众议稣馄蚁园镉钢骜锥狯眬鸰芗舱坛荡兰锎谋锑㲿嫔钱赆姹壸捞赇刿间缦杀拥佥妆砺㐷岛词鹛鸶馍镋缑羟锽饺姗茔拟从匀㨫鸨鹧锷韩苌涧贵㧑鲞鹪鲢鹝铄刭蔺尧误怆辆饾馕飔蛱诌绘穞韵罢迁嵚枣幞锴诟缋晒饫桠垄飚铏骦铙鳛涠谕讴毁标殡亚䥾虮㑩庐芦韫虽岘邺账铇䴗鹥请载齐铜镊轴鹆䩄诵饻闰阏绣钒锻溇驵阅㱩讽颉鹡雾芈秆鹇镛粜韬辫塆铲裢录䍀涩锊桢缚㭎网傥栅娆聪挡吓锳炝敌鲴鹨莴觉跸酾鳑鼌鹃篯镒态轲颞颂链粽缉祸崄涟赘冲滦栊鲑卖谛铭伪瘪褛镅娈聍础㭤涤胄硖摇饭椤庄尘饦悮筝辂绯锚蔂浓豮祯厅㛠稆两牵达屦啬谊馓勚㻏辗唛鳗埯厣扪诬绅悫觯勋镞䴘瞆陕丽绕诖莸绌闽铉荛杩鹊犸鲚谭沧盘进觎獭鳌够㖊谬彟驭倾䯃䥿㭣邝诶镈叹蜕颇觅壶莅辒亏阕绿铰鲜阙钤蹿鳢讱动铎龇涚骤蓟阊绷䜧龅镚玙鲻阳陉轿㑇钩溆续垒尔远绁伟阐渔鞯䢂饱袄驼䙊缫颚㳠㗷笔挣缱惫鲾栀赢氇鹫阈鸢铚踯汤库谌绖镡伤橹孙吣揿袜锆霡龟缏啸魇惮缓瘫拧箧骁椁奁虱毙䦆鳙懔车桤嚣绺颗锂赝昙镃鹗鸯氲冻鹙邮颒绉观狝䞐题绮饸络牍决鳒泺㓥诅现偾荚骐轧庙诋痖翘鲧鸸饬铧钑缙鸡门撺边缛疮鲁侠檩晕疗许咏摅辌别榈闷轻鸥侣鱼龌硙莲负峃预锗闿铥纼脓腭铔业泷纥䴖魉呗秃骇骅颡际缮艺煴拨鹣惭锇鹏鹖潇绗胧斩濑缣铑绸袯银宽㶉锅纪铸飖钰撑鸽鲔焘贬锤绾凉竖迳缂绢馂擞诇霉岁辚绹获噜镠猕鲟缳帻缃还龂龃钓舆样拦谑䞍婶摈饵炼镕诩㑔怅蝼颧绡镦伧郧浃哔䓨妪栈戗丢荝军狲驰䲝㛀项㑈䎬凫榇茑娱宾懑贝婴宁鲍䌾谔狰呖恺徕鹦谆垩椢鳅沤阘㛣荫悬簖劳翚沪㤽刘樱荠铟辇茧㳔结耢蝇树䦷戬帧苍吃赏阗诃栾诙滟浆钴疯䲟见铣毂䥺饯谍鳉膑栖蛰酦狱䂵贮频摄损镢馒崂镓饨㱮岗颙况鲵馉沩饴摊䓖启泸搁鲐㖞骥纺龋纰荟啰谂热炖峦骠鲤杂战䌶硵赟鲉髋侩馀谵烃胫挠钛猬锭赣灭鼍洼槟乔贾鱿畅薮鹔镥掺撸琎诂骀潋龙让骘约酂犹跞胪厉锩鿔鲸妇绦䘞剂镰缨驯刬饪诤轭锵鸭劝闩实过吕钪篓瞒铁氩贫胨诛闶馑飙阄珐栌榝庼调餍䴙职颦䦂谧坠䦶鹒击诹癞谏钺课捣汹骣听硗贱碍纴诀崭晋枥鸿叆节轷伣鼹锢馅酱枨鲬钙䲠赙纠龈囱芜蘖籼抠锹揽苘鲹阆㧏飐鹤趋锾队啴迩唢哒鹅鲪鬓荜琼枫铮暂镆释闺鸷轺阶弑郏犷窦卫垅鹲设襕铌讹铍黉鹰谨辽蛴销箨锓喷颜棂挚滠环跶镪诳垲临砻䃅庆琐颤铹证钇钆敚茏栉铯轸饮键钥梾舣兑陈贽椝峥瘅矾烁谖骍呓玛锲铿嬷钬眦头黾黩锨疖话镵闪咛钾畴给滤赃鞲窎电鹳剀诎瘗颏鲥问坝鲽叇怼鲩阁顼块镴伡铳诏龛蒋钔谜飕肠骒辄訚鸟俦砖鸼抚铛扰橥荥馋撄绳禄觐擜栎聩笋蚀鳈恹编蒀怂鲈窭濒屿潴梿锡皲筛阑垱谎岖坏秽呐镧谣阎鲺纫堑觑卤凑聋钷啭溅骈镌隐䁖䗖讻鸮鹟馁驿腘沟㧟鲓澛鳊砗转辈务灵镨缅戆苏旸跹码轮蛎鹂宪彻䘛钧袅线辔顶沣䟢彝锕猎颥济钊肮喽睐贪镍骊复惩归术浍骡难丝蝎亩炜蕰黪鳐脶敛骏涢颊鳣锱谟锜鹉联搄产嵘痈䞎裥义铃钲馔冁篑厐阇镄仑浑诣说缟㳕锰鲀带统伦瑷缒鹍彨毡祢麸简轰览钶挥虾厢碱纬玮陨开厍辙维铻锦驷饷锟缀觌颖鹜坞贲昵鱾驾阍逻狮碜疴䌷馊满诺桨慭囵虑娲烂鲣贡䌽购蓦鲘员颔缪记粤䌿铒玺势绂创惯椮骢涡疬籁棁领厌鲦监页币锒减讫镶骋铘莳莹鹋蚃鸫钌缇讬级鲳诡雠亵闳䏝䭪巯疭赍晓跄绪缩撵镜检跷腼笃妈㟜鹘荪镭橱帏惬弹忆䢁恻纻錾赊宫碛钋]')
ko = regex.compile(r'[\p{Script=Hangul}]')
latn = regex.compile(r'[\p{Script=Latin}\d]')

# %%
thrown_away = []
has_latn = []
keep = []

for i in rows:
    if not i:
        continue
    if len(i) != 2:
        print(i)
    if ko.search(i[1]):
        thrown_away.append(i)
    elif simp.search(i[1]):
        thrown_away.append(i)
    elif latn.search(i[1]):
        has_latn.append(i)
    else:
        keep.append(i)
    
# %%
write_csv(keep, prefix + '_review_keep.csv')
write_csv(has_latn, prefix + '_review_has_latn.csv')
# %%
